# Removing Missing Values

## Objectives

- Understand how missing values affect data handling in NumPy and Pandas.
- Demonstrate methods to identify and handle missing values in data arrays and frames.
- Evaluate the implications of different methods for handling missing values on data integrity and analysis.

## Background

The notebook provides a practical exploration of handling missing data in Python using NumPy and Pandas.

## Datasets Used

- **Synthetic Array Data**: Demonstrates handling None and NaN values in NumPy arrays.
- **Sample DataFrame of Students**: This data frame contains simulated student data with missing values in columns like age, sex, and GPA to showcase practical applications of Pandas' functions for handling missing data.
- **Automobile Dataset from UCI Machine Learning Repository**: Used to illustrate real-world application of these concepts, highlighting the impact of missing values on data types and analysis.

## Python Missing Values

In [1]:
import numpy as np 
import pandas as pd
pd.set_option('display.max_columns', 10)

`None`: Pythonic Missing Data

In [2]:
values = np.array([1, 2, None, 3, 4, 5])
values

array([1, 2, None, 3, 4, 5], dtype=object)

Notice `dtype=object` is the best common type representation for NumPy.

In [3]:
# Trying to change the type of the array to int
values.astype(int)              # This will raise an error

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'NoneType'

In [4]:
# With object type you cannot perform aggregations like mean(), sum()
values.mean()                   # This will raise an error!

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

`NaN`: missing numerical data (`NaN` acronym for Not a Number)

In [5]:
values2 = np.array([1, 2, np.nan, 3, 4, 5])
values2

array([ 1.,  2., nan,  3.,  4.,  5.])

In [6]:
# Cheching the array type
values2.dtype

dtype('float64')

NumPy chose a native floating-point type for the array.

In [7]:
# aggregates are well defined (i.e., they do not result in an error), but they are not useful
print(values2.min())
print(values2.max())
print(values2.mean())

nan
nan
nan

In [8]:
# NumPy does provide some special aggregations that will ignore these missing values
print(np.nanmin(values2))
print(np.nanmax(values2))
print(np.nanmean(values2))

1.0
5.0
3.0

In [9]:
# Creating a dataframe
dfv = pd.DataFrame({'values': values, 'values2': values2})
dfv

  values  values2
0      1      1.0
1      2      2.0
2   None      NaN
3      3      3.0
4      4      4.0
5      5      5.0

In [10]:
dfv.dtypes

values      object
values2    float64
dtype: object

Notice the column **values2** is float (because of the `NaN` value), but **values** is object.

In [11]:
# With pandas, we can aggregate, ignoring missing values
dfv.mean()

values     3.0
values2    3.0
dtype: object

In [12]:
dfv.sum()

values       15
values2    15.0
dtype: object

## Operating on Null Values

In [13]:
# Create a sample DataFrame
students = [
    ['st_100', 17, 'M', 3.7],
    ['st_101', 17, 'M', np.nan],
    ['st_102', np.nan, 'M', 2.4],
    ['st_103', np.nan, 'F', np.nan],
    ['st_104', 19, np.nan, 3]
]
df = pd.DataFrame(
    students,
    columns=['studentID', 'Age', 'Sex', 'GPA']
)
df

  studentID   Age  Sex  GPA
0    st_100  17.0    M  3.7
1    st_101  17.0    M  NaN
2    st_102   NaN    M  2.4
3    st_103   NaN    F  NaN
4    st_104  19.0  NaN  3.0

In [14]:
# Checking whether the DataFrame contains any NaN
df.isnull()

   studentID    Age    Sex    GPA
0      False  False  False  False
1      False  False  False   True
2      False   True  False  False
3      False   True  False   True
4      False  False   True  False

In [15]:
# Counting the NaN values in each column
df.isnull().sum()

studentID    0
Age          2
Sex          1
GPA          2
dtype: int64

In [16]:
# Counting the NaN values in each row
df.isnull().sum(axis=1)

0    0
1    1
2    1
3    2
4    1
dtype: int64

In [17]:
# Checking whether the DataFrame does not contain any NaN
df.notnull()

   studentID    Age    Sex    GPA
0       True   True   True   True
1       True   True   True  False
2       True  False   True   True
3       True  False   True  False
4       True   True  False   True

In [18]:
# Counting the not null values in each column
df.notnull().sum()

studentID    5
Age          3
Sex          4
GPA          3
dtype: int64

In [19]:
# Counting the not null values in each row
df.notnull().sum(axis=1)

0    4
1    3
2    3
3    2
4    3
dtype: int64

We want to remove NaN values from the DataFrame

In [20]:
# Dropping all rows with missing values 
df.dropna()

  studentID   Age Sex  GPA
0    st_100  17.0   M  3.7

In [21]:
# Dropping all columns with missing values 
df.dropna(axis=1)

  studentID
0    st_100
1    st_101
2    st_102
3    st_103
4    st_104

If we know that a particular column is critical to our analysis and only a tiny fraction of rows is missing a value, removing those rows from the dataset makes sense. Usually, we do not drop columns for our analysis. 

The previous instruction does not affect the DataFrame df

In [22]:
df

  studentID   Age  Sex  GPA
0    st_100  17.0    M  3.7
1    st_101  17.0    M  NaN
2    st_102   NaN    M  2.4
3    st_103   NaN    F  NaN
4    st_104  19.0  NaN  3.0

Other parameters of `dropna`:
- `how{'any', 'all'}`, default `'any'`
    - `'any'`: If any NA values are present, drop that row or column.
    - `'all'`: If all values are NA, drop that row or column.

In [23]:
# Creating a new column with all values NaN
df['allNaN'] = np.nan
df

  studentID   Age  Sex  GPA  allNaN
0    st_100  17.0    M  3.7     NaN
1    st_101  17.0    M  NaN     NaN
2    st_102   NaN    M  2.4     NaN
3    st_103   NaN    F  NaN     NaN
4    st_104  19.0  NaN  3.0     NaN

In [24]:
# Delete columns with all values NaN
df.dropna(axis=1, how='all')

  studentID   Age  Sex  GPA
0    st_100  17.0    M  3.7
1    st_101  17.0    M  NaN
2    st_102   NaN    M  2.4
3    st_103   NaN    F  NaN
4    st_104  19.0  NaN  3.0

In [25]:
# The previous instruction does not affect the DataFrame df
df

  studentID   Age  Sex  GPA  allNaN
0    st_100  17.0    M  3.7     NaN
1    st_101  17.0    M  NaN     NaN
2    st_102   NaN    M  2.4     NaN
3    st_103   NaN    F  NaN     NaN
4    st_104  19.0  NaN  3.0     NaN

Other parameters of `dropna`:
- thresh: int, optional
    - It requires `thresh` non-NaN values

In [26]:
# Delete rows with less than 3 non-NaN values, (rows with 0, 1 or 2 non-NaN values will be removed).
df.dropna(thresh=3)

  studentID   Age  Sex  GPA  allNaN
0    st_100  17.0    M  3.7     NaN
1    st_101  17.0    M  NaN     NaN
2    st_102   NaN    M  2.4     NaN
4    st_104  19.0  NaN  3.0     NaN

In [27]:
df

  studentID   Age  Sex  GPA  allNaN
0    st_100  17.0    M  3.7     NaN
1    st_101  17.0    M  NaN     NaN
2    st_102   NaN    M  2.4     NaN
3    st_103   NaN    F  NaN     NaN
4    st_104  19.0  NaN  3.0     NaN

In [28]:
# Delete columns with less than 3 non-NaN values, (cols with 0, 1, 2 or 3 non-NaN values will be removed).
df.dropna(thresh=3, axis=1)

  studentID   Age  Sex  GPA
0    st_100  17.0    M  3.7
1    st_101  17.0    M  NaN
2    st_102   NaN    M  2.4
3    st_103   NaN    F  NaN
4    st_104  19.0  NaN  3.0

In [29]:
# The previous instruction does not affect the DataFrame df
df

  studentID   Age  Sex  GPA  allNaN
0    st_100  17.0    M  3.7     NaN
1    st_101  17.0    M  NaN     NaN
2    st_102   NaN    M  2.4     NaN
3    st_103   NaN    F  NaN     NaN
4    st_104  19.0  NaN  3.0     NaN

In [30]:
# For keeping changes in the DataFrame
df.dropna(thresh=1, axis=1, inplace=True) 
df

  studentID   Age  Sex  GPA
0    st_100  17.0    M  3.7
1    st_101  17.0    M  NaN
2    st_102   NaN    M  2.4
3    st_103   NaN    F  NaN
4    st_104  19.0  NaN  3.0

The column `allNaN` is not part anymore of the DataFrame `df`

## Automobile Dataset

Let's use a real dataset and let's find out if there are missing values.

In [31]:
# Defining the headers
headers = [
    "symboling",
    "normalized_losses",
    "make",
    "fuel_type",
    "aspiration",
    "num_doors",
    "body_style",
    "drive_wheels",
    "engine_location",
    "wheel_base",
    "length",
    "width",
    "height",
    "curb_weight",
    "engine_type",
    "num_cylinders",
    "engine_size",
    "fuel_system",
    "bore",
    "stroke",
    "compression_ratio",
    "horsepower",
    "peak_rpm",
    "city_mpg",
    "highway_mpg",
    "price"
]

In [32]:
dfa = pd.read_csv(
    "https://archive.ics.uci.edu/ml/machine-learning-databases/autos/imports-85.data",
    header=None,
    names=headers,
    na_values="?"
)

dfa.head()

,symboling,normalized_losses,make,fuel_type,aspiration,...,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,NaN,alfa-romero,gas,std,...,111.0,5000.0,21,27,13495.0
1,3,NaN,alfa-romero,gas,std,...,111.0,5000.0,21,27,16500.0
2,1,NaN,alfa-romero,gas,std,...,154.0,5000.0,19,26,16500.0
3,2,164.0,audi,gas,std,...,102.0,5500.0,24,30,13950.0
4,2,164.0,audi,gas,std,...,115.0,5500.0,18,22,17450.0

In [33]:
dfa.dtypes

symboling              int64
normalized_losses    float64
make                  object
fuel_type             object
aspiration            object
num_doors             object
body_style            object
drive_wheels          object
engine_location       object
wheel_base           float64
length               float64
width                float64
height               float64
curb_weight            int64
engine_type           object
num_cylinders         object
engine_size            int64
fuel_system           object
bore                 float64
stroke               float64
compression_ratio    float64
horsepower           float64
peak_rpm             float64
city_mpg               int64
highway_mpg            int64
price                float64
dtype: object

Notice, for instance, the type of `normalized_losses` is `float64` despite having missing values.

In [34]:
# Checking the number of missing values in each column
missing_values = (dfa.isnull().sum())
print(missing_values[missing_values > 0])

normalized_losses    41
num_doors             2
bore                  4
stroke                4
horsepower            2
peak_rpm              2
price                 4
dtype: int64

Let's see what happen if we do not specify `na_values="?"`

In [35]:
dfb = pd.read_csv(
    "https://archive.ics.uci.edu/ml/machine-learning-databases/autos/imports-85.data",
    header=None,
    names=headers
)

dfb.head()

,symboling,normalized_losses,make,fuel_type,aspiration,...,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,?,alfa-romero,gas,std,...,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,...,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,...,154,5000,19,26,16500
3,2,164,audi,gas,std,...,102,5500,24,30,13950
4,2,164,audi,gas,std,...,115,5500,18,22,17450

Notice `normalized_losses` has `?` values. Its type will be `object`. Let's see it!

In [36]:
dfb.dtypes

symboling              int64
normalized_losses     object
make                  object
fuel_type             object
aspiration            object
num_doors             object
body_style            object
drive_wheels          object
engine_location       object
wheel_base           float64
length               float64
width                float64
height               float64
curb_weight            int64
engine_type           object
num_cylinders         object
engine_size            int64
fuel_system           object
bore                  object
stroke                object
compression_ratio    float64
horsepower            object
peak_rpm              object
city_mpg               int64
highway_mpg            int64
price                 object
dtype: object

In [37]:
# Replacing ? with NaN values (You should replace it in all variables with missing values)
dfb.normalized_losses.replace(to_replace='?', value=np.nan)

0      NaN
1      NaN
2      NaN
3      164
4      164
      ...
200     95
201     95
202     95
203     95
204     95
Name: normalized_losses, Length: 205, dtype: object

In [38]:
dfb.head()

,symboling,normalized_losses,make,fuel_type,aspiration,...,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,?,alfa-romero,gas,std,...,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,...,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,...,154,5000,19,26,16500
3,2,164,audi,gas,std,...,102,5500,24,30,13950
4,2,164,audi,gas,std,...,115,5500,18,22,17450

In [39]:
# The type does not change. It is better to use na_values="?" when reading the data!
dfb.dtypes

symboling              int64
normalized_losses     object
make                  object
fuel_type             object
aspiration            object
num_doors             object
body_style            object
drive_wheels          object
engine_location       object
wheel_base           float64
length               float64
width                float64
height               float64
curb_weight            int64
engine_type           object
num_cylinders         object
engine_size            int64
fuel_system           object
bore                  object
stroke                object
compression_ratio    float64
horsepower            object
peak_rpm              object
city_mpg               int64
highway_mpg            int64
price                 object
dtype: object

## Conclusions

Key Takeaways:
- It would help if you managed missing values to prevent errors in data analysis, as seen with operations on arrays containing None, which result in type errors.
- NaN is preferable for handling missing numerical data in NumPy, allowing operations that ignore these missing values without errors.
- Pandas offers robust tools for managing missing data, including functions to drop, fill, or replace missing values, essential for maintaining dataset integrity.
- Careful handling of missing data is crucial in real datasets to ensure accurate analysis, as demonstrated with the automobile dataset, where missing values significantly influence the data's usability for analytical purposes.

## References

- VanderPlas, J. (2017) Python Data Science Handbook: Essential Tools for Working with Data. USA: O’Reilly Media, Inc. chapter 3